Documents/ВыводИзОборотаИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыводИзОборотаИСМП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПлощадки</Name>
					<Comment>Внутренние значения полей адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПлощадкиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПервичныхДокументовИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыводаИзОборотаИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторЗаявкиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПричины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосударственногоКонтракта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемноСортовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныВыводаИзОборотаИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОбОтгрузкеНаЭкспорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭлектронногоПеревозочногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПеревозочногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревозочногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТранспортныеСредстваИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяМОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТаможеннойДекларации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПотребительскихУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сырье</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСырьяГИСМТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеВариантУчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеНоменклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеХарактеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатурыСырьяГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыСырьяГИСМТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСырьяГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВыводИзОборотаИСМП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
	Если ОбъемноСортовойУчет
		И Не ВыводИзОборотаКлиентСервер.ДоступноПолеОСУ(ТоварнаяГруппа) Тогда
		ОбъемноСортовойУчет = Ложь;
	КонецЕсли;
	
	Если ОбъемноСортовойУчет Тогда
		Документы.ВыводИзОборотаИСМП.ЗаполнитьДоступныеGTIN(ЭтотОбъект);
	КонецЕсли;
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
	Если ВыводИзОборотаКлиентСервер.ДоступноУведомлениеОбОтгрузкеНаЭкспорт(
		ВидыПродукцииПоТоварнойГруппе, Причина) Тогда
		УведомитьОбОтгрузкеНаЭкспорт = Истина;
	КонецЕсли;
	
	Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидыПродукцииПоТоварнойГруппе) Тогда
		ИспользуетсяМОД = Истина;
		ОбъемноСортовойУчет = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресПлощадки) Тогда
		ИдентификаторФИАС = ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(АдресПлощадки).Идентификатор;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ТоварнаяГруппа) Тогда
		РегистрыСведений.СоответствиеНоменклатурыСырьяГИСМТ.ЗаписатьСоответствие(ЭтотОбъект);
	КонецЕсли;
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
	
	ДоступноУведомлениеОбОтгрузкеНаЭкспорт = ВыводИзОборотаКлиентСервер.ДоступноУведомлениеОбОтгрузкеНаЭкспорт(
		ВидыПродукцииПоТоварнойГруппе, Причина)
		И УведомитьОбОтгрузкеНаЭкспорт;
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("Товары.КоличествоПотребительскихУпаковок");
	Если Не (ВыводИзОборотаКлиентСервер.ДоступноПолеВидПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, Причина)
		И ВыводИзОборотаКлиентСервер.ПроверятьЗаполнениеПоляВидПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, Причина)
		И ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументовИСМП.Прочее) Тогда
		НепроверяемыеРеквизиты.Добавить("НаименованиеПервичногоДокумента");
	КонецЕсли;
	
	Если Не ВыводИзОборотаКлиентСервер.ПроверятьЗаполнениеПоляЦена(ВидыПродукцииПоТоварнойГруппе, Причина) Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Цена");
		НепроверяемыеРеквизиты.Добавить("Товары.Сумма");
		НепроверяемыеРеквизиты.Добавить("Товары.СтавкаНДС");
	КонецЕсли;
	
	Если Не (ВыводИзОборотаКлиентСервер.ДоступноПолеВидПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, Причина)
		И ВыводИзОборотаКлиентСервер.ПроверятьЗаполнениеПоляВидПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, Причина)) Тогда
		НепроверяемыеРеквизиты.Добавить("ВидПервичногоДокумента");
		НепроверяемыеРеквизиты.Добавить("ДатаПервичногоДокумента");
		НепроверяемыеРеквизиты.Добавить("НомерПервичногоДокумента");
	КонецЕсли;
	
	Если ВыводИзОборотаКлиентСервер.ДоступноПолеВидПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, Причина)
		И НачалоДня(ДатаПервичногоДокумента) > НачалоДня(Дата) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата первичного документа не может быть больше даты вывода из оборота'"),
			ЭтотОбъект, "ДатаПервичногоДокумента",, Отказ);
	КонецЕсли;
	
	Если Не ВыводИзОборотаКлиентСервер.ДоступноПолеИдентификатораГосударственногоКонтракта(ВидыПродукцииПоТоварнойГруппе, Причина) Тогда
		НепроверяемыеРеквизиты.Добавить("ИдентификаторГосударственногоКонтракта");
	КонецЕсли;
	
	Если Не ВыводИзОборотаКлиентСервер.ДоступноПолеОписаниеПричины(ВидыПродукцииПоТоварнойГруппе, Причина) Тогда
		НепроверяемыеРеквизиты.Добавить("ОписаниеПричины");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Причина)
		И УдалитьОперация = Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаРеализацияНезарегистрированномуУчастнику Тогда
		НепроверяемыеРеквизиты.Добавить("Причина");
	КонецЕсли;
	
	ИспользованиеАдреса       = ВыводИзОборотаКлиентСервер.ДоступноПолеАдрес(ВидыПродукцииПоТоварнойГруппе, Причина);
	ИспользованиеАдресаВсегда = ВыводИзОборотаКлиентСервер.ПроверятьЗаполнениеПоляАдрес(ВидыПродукцииПоТоварнойГруппе, Причина);
	НепроверяемыеРеквизиты.Добавить("АдресПлощадкиСтрокой");
	
	Если ИспользованиеАдресаВсегда
		Или ИспользованиеАдреса И ЗначениеЗаполнено(АдресПлощадки) Тогда
		ПроверитьЗаполнениеАдреса(Отказ)
	КонецЕсли;
	
	ЭтоСырьеГИСМТ = КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидыПродукцииПоТоварнойГруппе);
	Если Не ЭтоСырьеГИСМТ Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.Сырье");
	КонецЕсли;
	
	ПроверятьЗаполнениеПоляGTIN = ОтгрузкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляGTIN(
		ВидыПродукцииПоТоварнойГруппе,
		Перечисления.ВидыОперацийИСМП.ВыводИзОборота);
	
	Если Не (ОбъемноСортовойУчет И ПроверятьЗаполнениеПоляGTIN) Тогда
		НепроверяемыеРеквизиты.Добавить("Товары.GTIN");
	КонецЕсли;
	
	Если Не ВыводИзОборотаКлиентСервер.ДоступноПолеСтранаНазначения(ВидыПродукцииПоТоварнойГруппе, Причина)
		И Не ДоступноУведомлениеОбОтгрузкеНаЭкспорт Тогда
		НепроверяемыеРеквизиты.Добавить("СтранаНазначения");
	КонецЕсли;
	
	Если Не МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляКонтрагент(ВидыПродукцииПоТоварнойГруппе, Причина)
		И Не ДоступноУведомлениеОбОтгрузкеНаЭкспорт Тогда
		НепроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	Если Не МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляТаможеннаяДекларация(ВидыПродукцииПоТоварнойГруппе, Причина) Тогда
		НепроверяемыеРеквизиты.Добавить("НомерТаможеннойДекларации");
	КонецЕсли;
	
	Если ДоступноУведомлениеОбОтгрузкеНаЭкспорт Тогда
		
		Если ТранспортныйДокумент Тогда
			НепроверяемыеРеквизиты.Добавить("НомерПеревозочногоДокумента");
			НепроверяемыеРеквизиты.Добавить("ДатаПеревозочногоДокумента");
			НепроверяемыеРеквизиты.Добавить("НомерТранспортногоСредства");
		Иначе
			НепроверяемыеРеквизиты.Добавить("ИдентификаторЭлектронногоПеревозочногоДокумента");
		КонецЕсли;
		
	Иначе
		
		НепроверяемыеРеквизиты.Добавить("ДатаОтгрузки");
		НепроверяемыеРеквизиты.Добавить("ИдентификаторЭлектронногоПеревозочногоДокумента");
		НепроверяемыеРеквизиты.Добавить("НомерПеревозочногоДокумента");
		НепроверяемыеРеквизиты.Добавить("ДатаПеревозочногоДокумента");
		НепроверяемыеРеквизиты.Добавить("НомерТранспортногоСредства");
		
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидыПродукцииПоТоварнойГруппе) Тогда
		ИнтеграцияИСМП.ПроверкаЗаполненияДанныхФармацевтическогоСырья(
			ЭтотОбъект, Причина, Отказ);
	Иначе
		ИнтеграцияИСМП.ПроверкаЗаполненияКоличестваПотребительскихУпаковок(ЭтотОбъект, Отказ);
		Если ОбъемноСортовойУчет Тогда
			ПроверитьЗаполнениеТоваровПриОСУ(Отказ);
		Иначе
			ИнтеграцияИСМПСлужебный.ПроверитьЗаполнениеШтрихкодовУпаковок(ЭтотОбъект, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование   = Неопределено;
	ИдентификаторЗаявки = Неопределено;
	СтранаНазначения    = Неопределено;
	
	ШтрихкодыУпаковок.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияВыводаИзОборотаИСМП(Организация, ТоварнаяГруппа);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		Если КлючИЗначение.Ключ = Метаданные.Документы.ВыводИзОборотаИСМП.Реквизиты.ОбъемноСортовойУчет.Имя
			И ЗначениеЗаполнено(ДокументОснование)
			И Не КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ДанныеСтатистики.ТоварнаяГруппа) Тогда
			Продолжить; // Признак объемно-сорового учета заполняется в переопредении
		КонецЕсли;
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
	Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ТоварнаяГруппа) Тогда
		ИспользуетсяМОД = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаПроверкиЗаполнения

Процедура ПроверитьЗаполнениеАдреса(Отказ)
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
	
	Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМОТП(ВидыПродукции) Тогда 
	
		ДанныеСтраны = УправлениеКонтактнойИнформацией.СтранаАдресаКонтактнойИнформации(АдресПлощадки);
		
		Если ДанныеСтраны.Ссылка = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
			
			ДанныеКИ         = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(АдресПлощадки);
			СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(ДанныеКИ);
			
			Если Не ЗначениеЗаполнено(СведенияОбАдресе.Индекс) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен Индекс в адресе'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "АдресПлощадкиСтрокой",, Отказ);
			ИначеЕсли Не ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен Код региона в адресе'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "АдресПлощадкиСтрокой",, Отказ);
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(ДанныеСтраны.Код) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен Код страны в адресе'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "АдресПлощадкиСтрокой",, Отказ);
			ИначеЕсли Не ЗначениеЗаполнено(АдресПлощадкиСтрокой) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен адрес'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "АдресПлощадкиСтрокой",, Отказ);
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли Не ЗначениеЗаполнено(ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(АдресПлощадки).Идентификатор) Тогда
		ТекстСообщения = НСтр("ru = 'Не найден идентификатор ФИАС'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "АдресПлощадкиСтрокой",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТоваровПриОСУ(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверятьЦены = ВыводИзОборотаКлиентСервер.ПроверятьЗаполнениеПоляЦена(ТоварнаяГруппа, Причина);
	
	СтрокиБезКоличестваУпаковокПоGTIN = Новый Соответствие();
	GTINСКоличествомУпаковок          = Новый Соответствие();
	
	СтрокиБезЦенПоGTIN = Новый Соответствие();
	GTINСЦенами        = Новый Соответствие();
	
	Для Каждого СтрокаТовары Из Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТовары.КоличествоПотребительскихУпаковок) Тогда
			GTINСКоличествомУпаковок.Вставить(СтрокаТовары.GTIN, Истина);
		Иначе
			СтрокиБезКоличества = СтрокиБезКоличестваУпаковокПоGTIN[СтрокаТовары.GTIN];
			Если СтрокиБезКоличества = Неопределено Тогда
				СтрокиБезКоличества = Новый Массив();
				СтрокиБезКоличестваУпаковокПоGTIN[СтрокаТовары.GTIN] = СтрокиБезКоличества;
			КонецЕсли;
			СтрокиБезКоличества.Добавить(СтрокаТовары);
		КонецЕсли;
		
		Если ПроверятьЦены Тогда
			Если ЗначениеЗаполнено(СтрокаТовары.Цена) Тогда
				GTINСЦенами.Вставить(СтрокаТовары.GTIN, Истина);
			Иначе
				СтрокиБезЦен = СтрокиБезЦенПоGTIN[СтрокаТовары.GTIN];
				Если СтрокиБезЦен = Неопределено Тогда
					СтрокиБезЦен = Новый Массив();
					СтрокиБезЦенПоGTIN[СтрокаТовары.GTIN] = СтрокиБезЦен;
				КонецЕсли;
				СтрокиБезЦен.Добавить(СтрокаТовары);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ШаблонСообщения = НСтр("ru = 'В строке № %1 списка ""Товары"" для GTIN ""%2"" не заполнено поле ""Коды маркировки""'");
	Для Каждого КлючИЗначение Из GTINСКоличествомУпаковок Цикл
		СтрокиБезКоличества = СтрокиБезКоличестваУпаковокПоGTIN[КлючИЗначение.Ключ];
		Если СтрокиБезКоличества <> Неопределено Тогда
			Для Каждого СтрокаТовары Из СтрокиБезКоличества Цикл
				ТекстСообщения  = СтрШаблон(ШаблонСообщения, СтрокаТовары.НомерСтроки, СтрокаТовары.GTIN);
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "КоличествоПотребительскихУпаковок"),,
					Отказ);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ШаблонСообщения = НСтр("ru = 'В строке № %1 списка ""Товары"" для GTIN ""%2"" не заполнено поле ""Цена""'");
	Для Каждого КлючИЗначение Из GTINСЦенами Цикл
		СтрокиБезЦен = СтрокиБезЦенПоGTIN[КлючИЗначение.Ключ];
		Если СтрокиБезЦен <> Неопределено Тогда
			Для Каждого СтрокаТовары Из СтрокиБезЦен Цикл
				ТекстСообщения  = СтрШаблон(ШаблонСообщения, СтрокаТовары.НомерСтроки, СтрокаТовары.GTIN);
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "Цена"),,
					Отказ);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
